In [1]:
%load_ext sql
%sql sqlite:///dataset_university.db

'Connected: @dataset_university.db'

In [2]:
%sql SELECT * FROM Faculty

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', None, 'mssong@postech.ac.kr', '2016-03-01'),
 ('fac002', 'Dong', 'Choi', 150, 'AS_PROF', 'IME', 'fac001', 'dgchoi@postech.ac.kr', '2016-03-01'),
 ('fac004', 'Myung', 'Ko', 250, 'PROF', 'IME', None, 'youngko@postech.ac.kr', '2012-03-01'),
 ('fac003', 'Min', 'Che', 200, 'PROF', 'IME', 'fac004', 'mchae@postech.ac.kr', '2019-05-01')]

In [3]:
%sql SELECT * FROM Faculty WHERE FacSSN = 'fac001'

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', None, 'mssong@postech.ac.kr', '2016-03-01')]

In [4]:
%sql SELECT FacFirstName, FacLastName, FacSalary FROM Faculty

 * sqlite:///dataset_university.db
Done.

[('Min', 'Song', 100),
 ('Dong', 'Choi', 150),
 ('Myung', 'Ko', 250),
 ('Min', 'Che', 200)]

In [5]:
%sql SELECT FacFirstName, FacLastName, FacSalary FROM Faculty WHERE FacSalary > 200 AND FacRank = 'PROF'

 * sqlite:///dataset_university.db
Done.

[('Myung', 'Ko', 250)]

In [6]:
%%sql 
SELECT FacFirstName, FacLastName, FacSalary*1.5 
AS IncreasedSalary, FacHireDate 
FROM Faculty WHERE FacHireDate < '2016-03-02';

 * sqlite:///dataset_university.db
Done.

[('Min', 'Song', 150.0, '2016-03-01'),
 ('Dong', 'Choi', 225.0, '2016-03-01'),
 ('Myung', 'Ko', 375.0, '2012-03-01')]

In [7]:
%sql SELECT * FROM Offering WHERE CourseNo LIKE 'im%';

 * sqlite:///dataset_university.db
Done.

[('offer01', 'FALL', 2020, 'Tue/Thur', 'imen001', 'fac001'),
 ('offer02', 'SPRING', 2019, 'Tue/Thur', 'imen003', 'fac002'),
 ('offer03', 'FALL', 2020, 'Tue/Thur', 'imen002', None),
 ('offer04', 'FALL', 2020, 'Mon/Wed', 'imen002', 'fac001'),
 ('offer05', 'FALL', 2020, 'Tue/Thur', 'imen003', 'fac004'),
 ('offer06', 'FALL', 2020, 'Tue/Thur', 'imen003', 'fac003')]

In [8]:
%sql SELECT * FROM Faculty WHERE FacLastName LIKE '_o%';

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song', 100, 'AS_PROF', 'IME', None, 'mssong@postech.ac.kr', '2016-03-01'),
 ('fac004', 'Myung', 'Ko', 250, 'PROF', 'IME', None, 'youngko@postech.ac.kr', '2012-03-01')]

In [9]:
%%sql 
SELECT FacFirstName, FacLastName, FacSalary*1.5 AS IncreasedSalary, FacHireDate 
    FROM Faculty 
    WHERE FacHireDate between date('2016-03-01') and date('2020-03-01');

 * sqlite:///dataset_university.db
Done.

[('Min', 'Song', 150.0, '2016-03-01'),
 ('Dong', 'Choi', 225.0, '2016-03-01'),
 ('Min', 'Che', 300.0, '2019-05-01')]

In [10]:
%%sql 
SELECT FacFirstName, FacLastName, FacSalary*1.5 AS IncreasedSalary, FacHireDate 
    FROM Faculty 
    WHERE FacHireDate between '2016-03-01' and '2020-03-01';

 * sqlite:///dataset_university.db
Done.

[('Min', 'Song', 150.0, '2016-03-01'),
 ('Dong', 'Choi', 225.0, '2016-03-01'),
 ('Min', 'Che', 300.0, '2019-05-01')]

In [11]:
%%sql 
SELECT OfferNo, CourseNo, FacSSN 
    FROM Offering 
    WHERE FacSSN IS NULL AND OffTerm = 'FALL' AND OffYear = 2020;

 * sqlite:///dataset_university.db
Done.

[('offer03', 'imen002', None)]

In [12]:
%%sql 
SELECT OfferNo, CourseNo, FacSSN 
    FROM Offering 
    WHERE (OffTerm = 'FALL' AND OffYear = 2020) OR (OffTerm = 'SPRING' AND OffYear = 2019)

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'fac001'),
 ('offer02', 'imen003', 'fac002'),
 ('offer03', 'imen002', None),
 ('offer04', 'imen002', 'fac001'),
 ('offer05', 'imen003', 'fac004'),
 ('offer06', 'imen003', 'fac003')]

In [13]:
%%sql 
SELECT OfferNo, CourseNo, FacFirstName, FacLastName 
    FROM Offering, Faculty 
    WHERE OffTerm = 'FALL' AND OffYear = 2020 AND FacRank = 'AS_PROF' 
        AND CourseNo LIKE 'im%' AND Faculty.FacSSN = Offering.FacSSN;

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Min', 'Song'), ('offer04', 'imen002', 'Min', 'Song')]

In [14]:
%%sql 
SELECT OfferNo, CourseNo, FacFirstName, FacLastName 
    FROM Offering INNER JOIN Faculty 
    ON Faculty.FacSSN = Offering.FacSSN
    WHERE OffTerm = 'FALL' AND OffYear = 2020 AND FacRank = 'AS_PROF' AND CourseNo LIKE 'im%';

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Min', 'Song'), ('offer04', 'imen002', 'Min', 'Song')]

In [15]:
%%sql
SELECT FacRank, AVG(FacSalary) AS AvgSalary
    FROM Faculty 
    GROUP BY FacRank;

 * sqlite:///dataset_university.db
Done.

[('AS_PROF', 125.0), ('PROF', 225.0)]

In [16]:
%%sql
SELECT StdMajor, AVG(StdGPA) AS AvgGpa 
    FROM Student 
    WHERE StdClass IN ('JR', 'SR')
    GROUP BY StdMajor 
    HAVING AVG(StdGPA) > 4.1

 * sqlite:///dataset_university.db
Done.

[('OR', 4.15)]

In [17]:
%%sql
SELECT Offering.OfferNo, COUNT(*) AS NumStudents 
    FROM Enrollment, Offering  
    WHERE Offering.OfferNo = Enrollment.OfferNo 
        AND OffYear = 2020
    GROUP BY Offering.OfferNo

 * sqlite:///dataset_university.db
Done.

[('offer01', 3),
 ('offer03', 5),
 ('offer04', 5),
 ('offer05', 3),
 ('offer06', 4)]

In [18]:
%%sql
SELECT FacRank, FacDept, COUNT(*) AS NumOfferings 
  FROM Faculty, Offering  
  WHERE Offering.FacSSN = Faculty.FacSSN 
    AND OffYear = 2020
  GROUP BY FacRank, FacDept
  HAVING COUNT(*) > 1

 * sqlite:///dataset_university.db
Done.

[('AS_PROF', 'IME', 2), ('PROF', 'IME', 2)]

In [19]:
%%sql

SELECT OfferNo, Offering.CourseNo, OffDays
    FROM Faculty, Course, Offering 
    WHERE Faculty.FacSSN = Offering.FacSSN
        AND Offering.CourseNo = Course.CourseNo 
        AND OffYear = 2020 AND OffTerm = 'FALL'  
        AND FacLastName = 'Song'

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Tue/Thur'), ('offer04', 'imen002', 'Mon/Wed')]

In [20]:
%%sql

SELECT Offering.OfferNo, Offering.CourseNo, OffDays, FacFirstName, FacLastName
 FROM Faculty, Offering, Enrollment, Student 
 WHERE Offering.OfferNo = Enrollment.OfferNo
   AND Student.StdSSN = Enrollment.StdSSN 
   AND Faculty.FacSSN = Offering.FacSSN 
   AND OffYear = 2020 AND OffTerm = 'FALL'
   AND StdFirstName = 'Jung'
    AND StdLastName = 'Lim'

 * sqlite:///dataset_university.db
Done.

[('offer01', 'imen001', 'Tue/Thur', 'Min', 'Song'),
 ('offer04', 'imen002', 'Mon/Wed', 'Min', 'Song'),
 ('offer05', 'imen003', 'Tue/Thur', 'Myung', 'Ko'),
 ('offer06', 'imen003', 'Tue/Thur', 'Min', 'Che')]

In [21]:
%%sql
SELECT Subr.FacSSN, Subr.FacLastName, 
    Subr.FacSalary, Supr.FacSSN, Supr.FacLastName, Supr.FacSalary
    FROM Faculty Subr, Faculty Supr
    WHERE Subr.FacSupervisor = Supr.FacSSN AND Subr.FacSalary > Supr.FacSalary

 * sqlite:///dataset_university.db
Done.

[('fac002', 'Choi', 150, 'fac001', 'Song', 100)]

In [22]:
%%sql

SELECT FacFirstName, FacLastName, O1.CourseNo
 FROM Faculty, Offering O1, Offering O2
 WHERE Faculty.FacSSN = O1.FacSSN 
   AND Faculty.FacSupervisor = O2.FacSSN 
   AND O1.OffYear = 2020 AND O2.OffYear = 2020 
      AND O1.CourseNo = O2.CourseNo

 * sqlite:///dataset_university.db
Done.

[('Min', 'Che', 'imen003')]

In [23]:
%%sql
SELECT CourseNo, Enrollment.OfferNo, Count(*) AS NumStudents
 FROM Offering, Enrollment
 WHERE Offering.OfferNo = Enrollment.OfferNo AND OffYear = 2020 AND OffTerm = 'FALL' 
 GROUP BY Enrollment.OfferNo, CourseNo

 * sqlite:///dataset_university.db
Done.

[('imen001', 'offer01', 3),
 ('imen002', 'offer03', 5),
 ('imen002', 'offer04', 5),
 ('imen003', 'offer05', 3),
 ('imen003', 'offer06', 4)]

In [24]:
%%sql

SELECT FacSSN AS SSN, FacFirstName AS FirstName,
       FacLastName AS LastName
    FROM Faculty
UNION 
SELECT StdSSN AS SSN, StdFirstName AS FirstName,
       StdLastName AS LastName
    FROM Student

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song'),
 ('fac002', 'Dong', 'Choi'),
 ('fac003', 'Min', 'Che'),
 ('fac004', 'Myung', 'Ko'),
 ('std001', 'Kang', 'Park'),
 ('std002', 'Duck', 'Lee'),
 ('std003', 'Jung', 'Lim'),
 ('std004', 'Han', 'Kim'),
 ('std005', 'Dae', 'Kim')]

In [25]:
%%sql
SELECT FacSSN AS SSN, FacFirstName AS 
       FirstName, FacLastName AS LastName
FROM Faculty
INTERSECT
SELECT StdSSN AS SSN, StdFirstName AS
       FirstName, StdLastName AS LastName
FROM Student

 * sqlite:///dataset_university.db
Done.

[('fac001', 'Min', 'Song')]

In [26]:
%%sql
SELECT FacSSN AS SSN, FacFirstName AS FirstName, FacLastName AS LastName 
FROM Faculty 
EXCEPT
SELECT StdSSN AS SSN, StdFirstName AS FirstName, StdLastName AS LastName
FROM Student

 * sqlite:///dataset_university.db
Done.

[('fac002', 'Dong', 'Choi'),
 ('fac003', 'Min', 'Che'),
 ('fac004', 'Myung', 'Ko')]

## interacting with database

In [32]:
import sqlite3
con = sqlite3.connect('test_test.db')
#con = sqlite3.connect(':memory:')

In [33]:
query = "drop table if exists test"
con.execute(query)

In [34]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL, d INTEGER);"""
con.execute(query)
con.commit()

In [35]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES (?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [36]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [37]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [38]:
DataFrame(rows, columns = ['a', 'b', 'c', 'd'])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5